#+TITLE:Emacs Configurations
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el
* PDF-Tools
#+begin_src emacs-lisp
(pdf-loader-install)
#+end_src
Now I never want things to automacally open veritcally, I want them to split vertically so
#+begin_src  emacs-lisp
(setq split-height-threshold nil)
(setq split-width-threshold 0)
(add-hook 'doc-view-mode-hook 'auto-revert-mode)
(setq revert-without-query '(".pdf"))
#+end_src

#+RESULTS:
| .pdf |

*** Agenda Files
#+begin_src emacs-lisp
(setq org-agenda-files
   (quote
    ("~/Dropbox/org/phd.org"
     "~/Dropbox/org/personal.org"
     "~/Dropbox/org/oxyML.org"
     )))
#+end_src

#+RESULTS:
| ~/Documents/MyOrgs/phd.org | ~/Documents/MyOrgs/personal.org | ~/Documents/MyOrgs/oxyML.org |

** Exports
#+begin_src emacs-lisp
(setq org-file-apps
   (quote
    ((auto-mode . emacs)
     (directory . emacs)
     ("\\.mm\\'" . default)
     ("\\.x?html?\\'" . "firefox %s")
     ("\\.pdf\\'" . org-pdftools))))
#+end_src

#+RESULTS:
: ((auto-mode . emacs) (directory . emacs) (\.mm\' . default) (\.x?html?\' . firefox %s) (\.pdf\' . org-pdftools))

*** Elpy
#+begin_src emacs-lisp
(use-package elpy
  :ensure t
  :init
  (elpy-enable))
(add-hook 'elpy-mode-hook (lambda () (highlight-indentation-mode -1)))
#+end_src

#+RESULTS:
| lambda | nil | (highlight-indentation-mode -1) |

